[
  {
    "id": "101",
    "type": "workshop",
    "title": "Fullstack App with Flutter and Firebase",
    "description": "Firebase and Flutter are two impressive stacks these days to build world-class applications at scale. These two have fantastic hand-to-hand features that make us as productive and agile as possible. Flutter is a UI toolkit to help you create beautiful applications that can run on six platforms. Firebase, on the other hand, is a fantastic serverless approach towards the backend as a service to help you run your applications at any scale.\n\nYou'll explore what the services are in Firebase. Next, you'll discover how to integrate a Flutter app with Firebase and use Authentication and Analytics services. Then, you'll delve into Firebase extensions. Then, you'll learn how to benefit from Cloud Firestore to manage your database and message to deliver push notifications to your users.\n\nAt the end of the workshop, you'll have the skills and knowledge to create a full-stack app using Flutter and Firebase needed to deliver a scalable and high-quality app to your customer.\n\nEach section comes with practices on a working app built throughout the workshop and is suitable for everyone who wants to learn Dart and Flutter from scratch.\n\nApproach:\nThe instructor will build a pre-designed page from a production application in the workshop.\n\nRequirements:\n- You are familiar with at least one programming language\n- You have done\n- Install on Windows (Please use this link https://flutter.dev/docs/get-started/install)\n- install in Linux / Mac (Please use this link https://flutter.dev/docs/get-started/install)\n- Setup Android Studio and Xcode (Please use this link https://flutter.dev/docs/get-started/install)\n- Setup Emulators (Please use this link https://flutter.dev/docs/get-started/install)\n- Setup IDEAs and Plugins (Please use this link https://flutter.dev/docs/get-started/install)\n\nAgenda:\n\nA quick Introduction to Dart\n- Dart variables and Constants\n- Strings and String Interpolation\n- Dart data types\n- Inheritance in Dart\n- Functional Dart\n- Dart Built-in types\n- Dart List/Array\n- Conditions in Dart\n- Streams and Future\n- Dart Standard Libraries\n- Package dependencies with Pub\n\nMastering Layouts, Widgets, and UI in Flutter\n- Material Design (ANDROID)\n- Cupertino Design (IOS)\n- Stateful and Stateless Widgets\n- Layouts (Column, Row, Grid, Positioned, Stack, StaggeredGridView, ...)\n- Widgets (Scaffold, App bar, Text, ... )\n- Styling in Flutter (Color, Fonts, Themes, Images, Backgrounds, padding, margin, borders, shadows, and SVGs)\n- GestureDetector and Inkwell\n\nNavigation and routing in Flutter & Basic State management and dependencies injection\n- Working with Navigator and GoRouter\n- Riverpod\n\nFirebase and Flutter Integration\n- Setup Firebase\n- Authentication with Firebase\n- Setup Firestore and CRUD operation\n- Firebase Extensions\n\nNetworking Layer\n- Working with Rest API\n- Working with JSON, Serializing, and Deserializing\n\nDeployment\n- building for iOS\n- build for Android\n\nAt the end of this workshop, we have implemented a fully functional real-time app that can be released on both App and Google Play stores.",
    "shortDescription": "Firebase and Flutter are two impressive stacks these days to build world-class applications at scale. These two have fantastic hand-to-hand features that make us as productive and agile as possible. Flutter is a UI toolkit to help you create beautiful applications that can run on six platforms. Firebase, on the other hand, is a fantastic serverless approach towards the backend as a service to help you run your applications at any scale.",
    "tags": [
      "Flutter",
      "Firebase"
    ],
    "speakerIds": [
      "006",
      "022"
    ]
  },
  {
    "id": "102",
    "type": "workshop",
    "title": "From Zero to Production with Jetpack Compose",
    "description": "Everyone has talked about the superiority of Compose over the classic UI (xml) in Android. I will not tell, but actually teach you how much faster, better and stronger app development with Compose is!\n\nThe workshop starts by talking about what Compose is and how it differs from the classic UI (xml) in Android, and it will end with a ready-to-use mobile application.\nBetween the introduction and the last section, we'll walk through the fundamental components of Compose, learn how to use them and what they are for.\n\nAgenda\n* Hello World: Android, Compose\n* Fundamentals part UI: Components, Modifiers, Layouts\n* Fundamentals part fundamental: Fundamentals, States, Effects\n* Theming\n* Animate me! \n* Adoptive layout\n* Testing\n\nPrerequisites:\nThe course is designed for those who already have the basics of programming with Android. \nExperience with Kotlin syntax, including lambdas.\nYou have to have Android Studio installed: (https://developer.android.com/studio).\n\nAfter this workshop you'll have enough experience and knowledge of Compose to create your own release-ready apps from skratch!",
    "shortDescription": "Everyone has talked about the superiority of Compose over the classic UI (xml) in Android. I will not tell, but actually teach you how much faster, better and stronger app development with Compose is!",
    "tags": [
      "Android",
      "Compose"
    ],
    "speakerIds": [
      "007"
    ]
  },
  {
    "id": "103",
    "type": "workshop",
    "title": "Create Beautiful Apps with SwiftUI",
    "description": "The hype is still buzzing for SwiftUI, Apple's latest framework for building user interfaces for iOS, tvOS, macOS, and watchOS.\nIn this workshop I will guide you through building an application from scratch. The workshop will cover all you need to know to build beautiful apps using SwiftUI!\n\nWe will also look into how widgets are created and managed for iOS applications.\n\nWhat you will learn:\n- How Swift and SwiftUI works\n- How to work with RESTful APIs and how to deal with JSON data\n- Building an interactable app from scratch\n\nAgenda:\n- Basics of Swift and SwiftUI\n- Your first app, Hello SwiftUI!\n- Views and how to build them\n- Structuring your app\n- Working with an API\n- Looking into widgets\n\nRequirements:\n- You are familiar with Swift as a programming language\n- You have the latest public version of Xcode downloaded and running. Download from here: https://developer.apple.com/xcode/",
    "shortDescription": "The hype is still buzzing for SwiftUI, Apple's latest framework for building user interfaces for iOS, tvOS, macOS, and watchOS.\nIn this workshop I will guide you through building an application from scratch. The workshop will cover all you need to know to build beautiful apps using SwiftUI!",
    "tags": [
      "iOS",
      "SwiftUI"
    ],
    "speakerIds": [
      "008"
    ]
  },
  {
    "id": "104",
    "type": "workshop",
    "title": "Analyzing mobile app usage using Python and Pandas",
    "description": "Mobile data analytics is the practice of collecting users usage data, and then analysing the data to understand their usage patterns. Using mobile analytics can lead to increased user satisfaction and retention.\n\nIn this workshop, you will learn some of the techniques you can use in your mobile app to gather user usage data, such as:\n* Various permissions granted by the user\n* Notifications (whether they allow notifications)\n* OS version on device\n* Time spent on each screen of your app\n* Time that users launch your app\n\nUsing the data collected, you will learn how to use Python and the Pandas library to perform analytics on these data. You will be able to derive useful information such as:\n* The usage pattern of individual users\n* The most popular pages of your app\n* The navigation pattern of your users\n* Which are the pages where the users usually encounter problems\n\nFor this workshop, you need the following software:\n* Anaconda (Download here: https://anaconda.com/products/distribution)\n\nTopics covered\n---------------\n* Creating the REST API for collecting data\n* Sending usage data from your mobile app (React Native and Flutter code provided) to the server\n* Using Pandas to analyze your data\n* Using matplotlib for visualization\n\nPrerequisites\n-------------\n* Knowledge of Python would be useful but not mandatory\n* Code samples in Flutter and React Native will provided; however, participants are not required to do mobile development during the workshop\n* The main focus for this workshop is data analytics",
    "shortDescription": "Mobile data analytics is the practice of collecting users usage data, and then analysing the data to understand their usage patterns. Using mobile analytics can lead to increased user satisfaction and retention.",
    "tags": [
      "Python",
      "Pandas",
      "Analytics"
    ],
    "speakerIds": [
      "001"
    ]
  },
  {
    "id": "105",
    "type": "keynote",
    "title": "The Only Easy Day Was Yesterday, and How to Survive Today and Tomorrow",
    "description": "If you are a developer, you are like a member of the Navy SEALs - you need to arm yourself with a myriad of skills in order to execute your mission successfully. Coupled with the rapid advancement in software and hardware technologies, every day is a learning day.\n\nIn this keynote, veteran author and developer Wei-Meng Lee will share with you his development journey for the past two decades, beginning with his early days as a C developer for Apple System 7, to the current days as a Web3 developer and trainer. Wei-Meng will share his ups and downs for the past 20 years (from the early days of desktop apps development, mobile development, data science, and more recently, blockchain), and how to keep learning in an industry where things get outdated as soon as they are introduced. If you are overwhelmed with new skills to learn, Wei-Meng will share with you some tips on how to learn quickly, and how to keep yourself motivated. If Wei-Meng can do it, so can you!",
    "shortDescription": "If you are a developer, you are like a member of the Navy SEALs - you need to arm yourself with a myriad of skills in order to execute your mission successfully. Coupled with the rapid advancement in software and hardware technologies, every day is a learning day.",
    "tags": [
      "Inspirational"
    ],
    "speakerIds": [
      "001"
    ]
  },
  {
    "id": "106",
    "type": "Talk",
    "title": "Fast track your idea with Flutter",
    "description": "Have you wanted to build a mobile app and not know where to start? Or perhaps you’ve heard about Flutter but you aren’t sure what it is. In either case this talk is for you.\n\nThis talk will highlight key features of flutter with a build-along-with me style talk to show how you can go from zero to a functioning app.\n\nIn this session you’ll learn how to turn an idea into a beautiful cross platform application using Flutter.",
    "shortDescription": "Have you wanted to build a mobile app and not know where to start? Or perhaps you’ve heard about Flutter but you aren’t sure what it is. In either case this talk is for you.",
    "tags": [
      "Flutter",
      "101"
    ],
    "speakerIds": [
      "003"
    ]
  },
  {
    "id": "107",
    "type": "Talk",
    "title": "How to accelerate your startup with fundraising?",
    "description": "Interested in launching a startup and raising money from investors? Got a great idea and a plan, but need the money to realise it? Here is what to do!\n\nIn this interview style talk, Monica and Raja will discuss what entrepreneurs and startup-ers need to have in place before looking for investors.",
    "shortDescription": "Interested in launching a startup and raising money from investors? Got a great idea and a plan, but need the money to realise it? Here is what to do!",
    "tags": [
      "Startup",
      "Inspirational"
    ],
    "speakerIds": [
      "004",
      "005"
    ]
  },
  {
    "id": "108",
    "type": "Talk",
    "title": "Warning!! New technology ahead!",
    "description": "When Apple announces new tech, we’re eager to jump on ASAP until we realize that we’ll need to wait some years… When the time comes to use the latest and greatest the question becomes “How do we safely integrate this in our code”.\n\nIn the past few years, we've seen some big changes on iOS (namely SwiftUI and async / await) and developers are eager to make use of these technologies. However, you can't rush in and start migrating over without a plan. \n\nThis talk will provide some do's and don'ts for a big migration, as well as some insights into how other companies approach this. I'll also talk a little bit about how management and development can be misaligned on the need for new tech, and how developers can make a strong case for management to allow adopting new tech.\n\nWe end the talk with a broad code-level exploration of where to start implementing new technology, and how we can do this in a way that doesn't require us to refactor an entire codebase all at once.",
    "shortDescription": "When Apple announces new tech, we’re eager to jump on ASAP until we realize that we’ll need to wait some years… When the time comes to use the latest and greatest the question becomes “How do we safely integrate this in our code”?",
    "tags": [
      "iOS",
      "Learnings"
    ],
    "speakerIds": [
      "002"
    ]
  },
  {
    "id": "109",
    "type": "Talk",
    "title": "How to NOT make an app - Let's develop an app with awful UX",
    "description": "The aim of every developer is to build an app with an amazing and intuitive User Experience. But what if we turn that around and try to make an app with the worst UX possible?\n\nIn this fun little talk we're gonna turn a Flutter app with a great UX into an app with an awful one. In the process we will learn and experience why and how good UX is actually good.",
    "shortDescription": "The aim of every developer is to build an app with an amazing and intuitive User Experience. But what if we turn that around and try to make an app with the worst UX possible?",
    "tags": [
      "Flutter",
      "UX"
    ],
    "speakerIds": [
      "018"
    ]
  },
  {
    "id": "110",
    "type": "Talk",
    "title": "We ain’t got no time - Building an app fast without giving up on quality",
    "description": "This is the story of the SoundCloud Wear OS app. Confronted with limited developer resources and a fixed deadline we challenged what many developers see in their daily lives. Though we did not intend to give up on quality to achieve this goal.\n\nSmall feedback cycles and bleeding edge (pre-alpa) APIs were things we used to cut corners.\nAlthough this talk is about WearOS the learnings are not limited to it, but are transferable to any app development.\n\nThis is our story, what went well and what went wrong and how you can take these learnings into your own project.",
    "shortDescription": "This is the story of the SoundCloud Wear OS app. Confronted with limited developer resources and a fixed deadline we challenged what many developers see in their daily lives.",
    "tags": [
      "Android",
      "Learnings"
    ],
    "speakerIds": [
      "009"
    ]
  },
  {
    "id": "111",
    "type": "Talk",
    "title": "Boost UX with Mobile UX Design Principles and Best Practices",
    "description": "How can app developers boost the UX of their mobile apps, lower the barriers to adoption, reduce abandonment rates, and increase conversions? By following mobile UX design best practices, standards, and accepted golden rules of UX!\n\nPeople want convenience, speed, and efficiency when using their mobile. However, many apps frustrate people with bad UX by not following established mobile UX design standards and best practices. \n\nFor example, eCommerce sites and apps lose billions every year because they don’t follow simple UX best practices. It’s common knowledge that 75% of people download an app, open it once, and never use it again.\n\nWe can unlock a solution: great mobile UX relies on standards, conventions, and “golden rules.” In this entertaining presentation, participants will acquire knowledge of specific mobile UX design best practices, interaction design principles, usability guidelines, and the “laws of UX”. We’ll look at good and bad examples as we cover detailed methods to boost mobile UX.",
    "shortDescription": "How can app developers boost the UX of their mobile apps, lower the barriers to adoption, reduce abandonment rates, and increase conversions?",
    "tags": [
      "UX",
      "Design"
    ],
    "speakerIds": [
      "010"
    ]
  },
  {
    "id": "112",
    "type": "Talk",
    "title": "The state of apps in Norway 2023",
    "description": "As the largest app developer company in the Nordics, we have unique insights into the Norwegian app market. In this talk we present trends and data from our in-house analytics tools and clients.\n\nIvan Le Hjelmeland and Yngve Hellman have over 34 years of combined experience developing digital solutions. They are partners at Shortcut and have worked there since 2016. This talk is a soft inspirational talk about how apps are doing in the Norwegian market today.\n\nAt Shortcut we have developed several internal analytics tools and work with many large clients across the nordics. In this talk we use the insights from these sources and others to outline the state of the Norwegian app market, both from a business perspective and a technical perspective.",
    "shortDescription": "As the largest app developer company in the Nordics, we have unique insights into the Norwegian app market. In this talk we present trends and data from our in-house analytics tools and clients.",
    "tags": [
      "Inspirational",
      "Trends"
    ],
    "speakerIds": [
      "015",
      "016"
    ]
  },
  {
    "id": "113",
    "type": "Talk",
    "title": "Building Reusable SwiftUI Components",
    "description": "SwiftUI makes it easy to create beautiful UI in no time, but it is just as easy to end up with a giant view that mixes view code and business logic.\n\nIn this talk you'll learn how to use Xcode to create reusable SwiftUI components for your own projects or for distributing to other developers.\n\nIn this talk, I am going to show you how to\n\n* refactor an existing SwiftUI view to make it more maintainable,\n* turn it into a reusable SwiftUI component,\n* add event handling,\n* make the view configurable,\n* add it to the Xcode component library,\n* turn it into a shareable component that can be consumed via Swift Package Manager, and distribute it via GitHub and the Swift Package Index",
    "shortDescription": "SwiftUI makes it easy to create beautiful UI in no time, but it is just as easy to end up with a giant view that mixes view code and business logic.",
    "tags": [
      "iOS"
    ],
    "speakerIds": [
      "019"
    ]
  },
  {
    "id": "114",
    "type": "Talk",
    "title": "Mobile, Desktop, Web, & Beyond with C#, .NET MAUI, & Blazor",
    "description": ".NET MAUI enables developers to build native cross-platform mobile and desktop apps with .NET and C#. Blazor gives developers the ability to build world class interactive web apps all from C# without ever needing to write a line of JavaScript. Combine these two together and you can build apps for nearly every platform from web, iOS, Android, Mac, Windows, and beyond! Join Ben as he breaks down every part of .NET MAUI & Blazor that you need to know about and how you can leverage your existing C# and .NET skills, libraries, and tools to build awesome apps.\n\nThis talk will be a combination of slides and live coding where I will create a Blazor Hybrid app from scratch and talk through the various elements of the app demoing a number of key features such as CSS support and HotReload. ",
    "shortDescription": ".NET MAUI enables developers to build native cross-platform mobile and desktop apps with .NET and C#. Blazor gives developers the ability to build world class interactive web apps all from C# without ever needing to write a line of JavaScript.",
    "tags": [
      "X-platform",
      "101"
    ],
    "speakerIds": [
      "017"
    ]
  },
  {
    "id": "115",
    "type": "Talk",
    "title": "Lightning talks ⚡️",
    "description": "Listen to great stories from different speakers in a rapid format!\n\n- ChatGPT and your Mobile App Development Workflow -\nChatGPT has taken the world by storm and not just in software development circles. I've seen seasoned software engineers scoff at integrating ChatGPT into their software development workflow, but I ask: why? What are the benefits, the downsides, the risks?\n\n-----\n\n- Working NO-to-5 -\nWorking 9-5 is an overrated thing of the past. We are living in an increasingly fast-paced society and yet choose to lose 2-3 hours per day on travel? This does not compute.\n\n-----\n\n- Kotlin DSL. This language is broken, bring a new one! -\nA domain-specific language (DSL) is a computer language specialized to a particular application domain. This is in contrast to a general-purpose language (GPL), which is broadly applicable across domains. Kotlin allows you to write your own language as quickly as possible.",
    "shortDescription": "ChatGPT and your Mobile App Development Workflow\n\n-----\n\nWorking NO-to-5\n\n-----\n\nKotlin DSL. This language is broken, bring a new one!",
    "tags": [
      "Lightning",
      "Inspirational"
    ],
    "speakerIds": [
      "014",
      "013",
      "007"
    ]
  },
  {
    "id": "116",
    "type": "Talk",
    "title": "Half talks ⚡️",
    "description": "Listen to great speakers help you with your startup or what you need to go freelance!\n\n- How to accelerate your startup with fundraising? - \nInterested in launching a startup and raising money from investors? Got a great idea and a plan, but need the money to realise it? Here is what to do!\n\nIn this interview style talk, Monica and Raja will discuss what entrepreneurs and startup-ers need to have in place before looking for investors.\n\n-----\n\n- 11 Years of Freelance App Development Experience -\nSince 2012 I’ve worked on over 23 different apps, for at least 23 clients, with user bases ranging from 1,000 to 100,000 to 1m+. I’ve worked for startups, corporates, agencies & solo founders - and I’ve seen it all.\n\nIn this talk I’m going to break down my time as a freelance app developer into the golden nuggets of wisdom I’ve picked up along the way to help you in your everyday career as an App developer.",
    "shortDescription": "How to accelerate your startup with fundraising?\n\n-----\n\n11 Years of Freelance App Development Experience",
    "tags": [
      "Lightning",
      "Inspirational"
    ],
    "speakerIds": [
      "005",
      "004",
      "021"
    ]
  },
  {
    "id": "117",
    "type": "Talk",
    "title": "Building a real-time quiz application with Jetpack Compose and AWS Amplify",
    "description": "With the Declarative UI taking over the world. Jetpack Compose also became \"the\" way that Android applications will be developed in the future. A lot of applications already embraced it and everybody enjoys it. But what if you want to see Jetpack Compose in action with a full serverless real-time/real life backend? Thankfully AWS Amplify comes to the rescue. AWS Amplify is a set of libraries that is provided to developers to create applications.\n\nIn this talk you will learn about how you can create and architect a real-time quiz application by using AWS Amplify and Jetpack Compose. You will learn the capabilities of AWS Amplify and how you can combine the power of it with Jetpack Compose.",
    "shortDescription": "With the Declarative UI taking over the world. Jetpack Compose also became \"the\" way that Android applications will be developed in the future.",
    "tags": [
      "Android"
    ],
    "speakerIds": [
      "020"
    ]
  },
  {
    "id": "118",
    "type": "Talk",
    "title": "UI Tests you won't hate",
    "description": "UI tests can be both hard to write and a pain to maintain. In this talk we will walk you through some principles and tricks we've applied at two of the most used apps in Norway, Ruter and NRK TV.\n\nWe will share with you what we have learned and experienced in these projects, and discuss how UI-tests can be written to last, leveraged to verify analytics, and how snapshot-testing can be used to close the gap between UI- and unit-tests. We will also explore how to best tackle concurrency in Espresso and deal with legacy code and external dependencies. Finally, we will tie it all together with examples of how this can be run in CI.",
    "shortDescription": "UI tests can be both hard to write and a pain to maintain. In this talk we will walk you through some principles and tricks we've applied at two of the most used apps in Norway, Ruter and NRK TV.",
    "tags": [
      "iOS",
      "Android",
      "Testing"
    ],
    "speakerIds": [
      "011",
      "012"
    ]
  }
]