[
  {
    "id": "001",
    "keynote": true,
    "imgSrc": "/public/img/speakers/wei-meng-lee.jpg",
    "name": "Wei-Meng Lee",
    "employer": "Developer Learning Solutions",
    "bio": "Wei-Meng Lee is a technologist and founder of Developer Learning Solutions, a technology company specializing in hands-on training on the latest technologies. He is an established developer and trainer specializing in Data Science, Blockchain, and Mobile technologies.\n\nWei-Meng speaks regularly at international conferences and has authored and co-authored numerous books on topics ranging from blockchain to machine learning. He currently writes a regular column for Towards Data Science and Code Magazine. He is also the author of Beginning Ethereum Smart Contracts Programming and Python Machine Learning.",
    "twitterTag": "weimenglee",
    "githubLink": "https://github.com/weimenglee",
    "website": "http://calendar.learn2develop.net/"
  },
  {
    "id": "002",
    "keynote": false,
    "imgSrc": "/public/img/speakers/donnywals.jpeg",
    "name": "Donny Wals",
    "employer": "donnywals.com",
    "bio": "Donny is a freelance iOS Developer, speaker, and author of a blog and various books on iOS related topics. He's been doing iOS development for about 8 years by now, and have been a developer for about 14 years in total.",
    "twitterTag": "donnywals",
    "githubLink": "https://github.com/donnywals",
    "website": "https://donnywals.com/"
  },
  {
    "id": "003",
    "keynote": false,
    "imgSrc": "/public/img/speakers/tiya.jpg",
    "name": "Tiya Chowdhury",
    "employer": "Google",
    "bio": "Tiya is a software engineer at Google Health working with Flutter. She has previously worked for DeepMind, Amazon and Accenture. Tiya has built mobile apps both as part of her role at Google health and externally, in addition she is writing blogs and have spoken at various conferences.",
    "twitterTag": "tiyachows"
  },
  {
    "id": "004",
    "keynote": false,
    "imgSrc": "/public/img/crew/monica.jpeg",
    "name": "Monica Beate Tvedt",
    "employer": "Forte Digital",
    "bio": "Monica has more than 20 years of national and international experience working as a Tech leader and software engineer building SaaS, Web and Mobile applications for sectors such as; Telecom, Engineering, Retail and Banking.\n\nBesides her love for Tech and building tech companies, she spends as much time as she can working on gender equality initiatives, organizing Mobile Tech Meetups, Guest Lecturing and teaching new tech to the next generation.\n\nMonica is someone who not only has solid experience from the industry, but also has helped shape it. She has long marked herself as a strong influencer, and has been credited as a role model for women in tech and came on the list of Norway’s 50 most influential women in tech in 2021.",
    "githubLink": "https://github.com/StargrrlMoonlight"
  },
  {
    "id": "005",
    "keynote": false,
    "imgSrc": "/public/img/speakers/raja.jpg",
    "name": "Raja Skogland",
    "employer": "thevisionaryvc.com",
    "bio": "Raja is a serial entrepreneur, investor in 70+ startups, business advisor and university lecturer.",
    "website": "https://www.thevisionaryvc.com"
  },
  {
    "id": "006",
    "keynote": false,
    "imgSrc": "/public/img/crew/majid.jpeg",
    "name": "Majid Hajian",
    "employer": "Invertase",
    "bio": "Majid is a Google developer expert and passionate software developer with years of developing and architecting complex web and mobile applications. He is an award-winning book author at Apress and instructor at PacktPub/Udemy and Pluralsight. His passions are generally Flutter, PWA, and performance.\nHe loves sharing his knowledge with the community by writing and speaking, having workshops and video tutorials, contributing to open source, and organizing meetups and events. He is also the organizer of several big Nordic conferences and meetups, such as FlutterVikings!\n\nMajid is a workshop holder for and also a co-organizer of Apprise conf!",
    "twitterTag": "mhadaily",
    "githubLink": "https://github.com/mhadaily",
    "website": "https://majidhajian.com/"
  },
  {
    "id": "007",
    "keynote": false,
    "imgSrc": "/public/img/speakers/daniil.jpeg",
    "name": "Daniil Pastukhou",
    "employer": "Bouvet Norge",
    "bio": "Daniil is a mobile Tech lead at Bouvet. He has worked on many different parts of Android and is now exploring how far he can push Jetpack Compose.\n\n- \"I remember Android Gingerbread :D\"\n\nDaniil is also one of the workshop holders for Apprise Conf."
  },
  {
    "id": "008",
    "keynote": false,
    "imgSrc": "/public/img/speakers/oddbjorn.jpeg",
    "name": "Oddbjørn Almenning",
    "employer": "FotMob",
    "bio": "Oddbjørn is the iOS Tech Lead for the FotMob App.\n\nHe is one of the workshop holders for Apprise Conf."
  },
  {
    "id": "009",
    "keynote": false,
    "imgSrc": "/public/img/speakers/danny.JPG",
    "name": "Danny Preussler",
    "employer": "SoundCloud",
    "bio": "Danny is a developer by heart, living in Berlin, and leading the Android team at SoundCloud. He worked for companies like Groupon, Viacom, eBay, and Alcatel and started his mobile career long before any Android with Java ME and Blackberry applications.\n\nDanny writes and talks about mobile development and testing regularly and is a Google Developer Expert for Android and Kotlin.",
    "twitterTag": "PreusslerBerlin",
    "githubLink": "https://github.com/dpreussler",
    "website": "https://dpreussler.medium.com/"
  },
  {
    "id": "010",
    "keynote": false,
    "imgSrc": "/public/img/speakers/Miklos.jpg",
    "name": "Miklos Philips",
    "employer": "Self",
    "bio": "Miklos is a Lead UX Designer/Product Designer with 17+ years of experience. Most recently at the Financial Times in London, he'd spent most of his career in New York, San Francisco, and LA working across various industries.",
    "twitterTag": "MiklosPhilips",
    "website": "http://miklosphilips.com/"
  },
  {
    "id": "011",
    "keynote": false,
    "imgSrc": "/public/img/speakers/joakim.jpeg",
    "name": "Joakim Stien",
    "employer": "Forse Mobil",
    "bio": "Joakim is a developer with a passion for making things spin. He has been making apps on a hobby & freelance basis since ~2011 and professionally since 2019.",
    "twitterTag": "superpimms",
    "githubLink": "https://github.com/pimms"
  },
  {
    "id": "012",
    "keynote": false,
    "imgSrc": "/public/img/speakers/frode.jpeg",
    "name": "Frode Nilsen",
    "employer": "Forse Mobil",
    "bio": "Frode has been a professional and passionate app developer for 10 years and fullstack developer before that. He's currently working with a point of sales system in public transport, and also have experience from publishing, banking and game development.\n\nWhat truly fascinates him about being a software engineer is how vastly different the domains we work against are. He's got deep respect for the domain experts we meet and the knowledge they possess. Working hard in cooperation creates valuable computer systems.",
    "twitterTag": "nilzor",
    "githubLink": "https://github.com/Nilzor"
  },
  {
    "id": "013",
    "keynote": false,
    "imgSrc": "/public/img/speakers/emin.jpeg",
    "name": "Emin Grbo",
    "employer": "TIDAL",
    "bio": "Emin is an iOS dev with 3 years of experience working for TIDAL in Oslo. Before that he was a UX designer (mostly freelance and DDB work).\n\nHe's very passionate about building products and helping people reach their goals.",
    "twitterTag": "emin_ui",
    "githubLink": "https://github.com/emin-grbo",
    "website": "https://undeadpixel.dev"
  },
  {
    "id": "014",
    "keynote": false,
    "imgSrc": "/public/img/speakers/johns.jpeg",
    "name": "John Solsma",
    "employer": "Big Nerd Ranch",
    "bio": "John is a Senior Engineering Manager and iOS Solution Architect with 10 years experience writing mobile apps. He's developed iOS apps for clients such as Apple and AT&T and developed one of the worlds first direct-to-device esim-installation apps.",
    "githubLink": "https://github.com/SolsmaHawk",
    "website": "https://solsmadev.com"
  },
  {
    "id": "015",
    "keynote": false,
    "imgSrc": "/public/img/speakers/ivan.jpg",
    "name": "Ivan Le Hjelmeland",
    "employer": "Shortcut",
    "bio": "Ivan is Shortcut's primary App Evangelist and runs the Shortcut Bergen Office. He has dedicated his life to apps - releasing over 20 apps through Shortcut, and 40 privately. He has 11 years of experience developing apps.",
    "twitterTag": "ivanhjel",
    "githubLink": "https://github.com/ivanhjel",
    "website": "https://shortcut.io/"
  },
  {
    "id": "016",
    "keynote": false,
    "imgSrc": "/public/img/speakers/yngve.jpeg",
    "name": "Yngve Hellman",
    "employer": "Shortcut",
    "bio": "Yngve is the head of business development and advisory at Shortcut, the largest App developer company in the Nordics. He has 23 years of experience designing digital solutions.",
    "twitterTag": "yngveh",
    "githubLink": "https://github.com/ivanhjel",
    "website": "https://shortcut.io/"
  }
]